import 'package:flutter/cupertino.dart';
import 'package:flutter_html/flutter_html.dart';

class offlineDatas {
  static List restaurantData = [
    "ရွှေလင်းစံ စားသောက်ဆိုင်",
    "အမှတ် (၄၃၆)၊ ခေမာ၀ီလမ်းမကြီး မြောက်ဥက္ကလာပ မြို့နယ်"
  ];

  static Map itemNames = {
    "itemOne": {
      "title": "Top Menus",
      "items": ["ကင်းမွန် မာဆလာ", "ခရု ပုစွန်ဆော့", "ပင်လယ်စာ အစုံဗန်း"]
    },
    "itemTwo": {
      "title": "Indian Food",
      "items": [
        "Potato Paratha",
        "Char Par Te",
        "Potato Puri",
        "Sarmusa",
      ]
    },
    "itemThree": {
      "title": "Japanese Food",
      "items": ["Tan Pu Ra", "Su Shi", "Wassabi Fried Rice", "Dumplings"]
    },
    "itemFour": {
      "title": "Western Food",
      "items": ["Hot Dog", "Lasagna", "Humburger", "Sandwich"]
    },
    "itemFive": {
      "title": "Drinks",
      "items": [
        "Cheesy Bubble Tea",
        "BlueBerry Milk Tea",
        "Green Leaves Milk Tea",
        "Set A"
      ],
    },
    "itemSix": {
      "title": "Western Food",
      "items": ["Hot Dog", "Lasagna", "Humburger", "Sandwich"]
    }
  };
}

List itemNames = [
  'Top Menu',
  'တရုတ် အစားအစာ',
  'Western Food',
  'အရှေ့တိုင်း အစားအစာ',
  'ဂျပန်အစားအသောက်',
  'Drinks'
];

const htmlData = r"""
<p style='color: black; text-align: start;display: block;'>

ချွမ်း​ဝေဝမ် မာလာ​မောက်ချိုက်အနှစ်ကို အရိုးပြုတ်ရည် (ဒါမှမဟုတ်) ​ရိုးရိုးရေထဲ ချိန်ဆ ထည့်ပြီး တည်ပါ။ 
ပွက်ပွက်ဆူ လာပြီ ဆိုရင်​တော့ ကိုယ်ကြိုက်နှစ်သက်ရာ အသား၊ အရွက်​တွေ ထည့်ပြုတ်လို့ ရပါပြီ​​။ 
ပါဝင် ပစ္စည်း​တွေ အကုန်ကျက်ပြီဆိုရင်​တော့ ​ပူပူ​နွေး​နွေး အဝ ​​လွေးလို့ ရပါပြီ​နော်။ 
Wow....လွယ်လွယ်​လေးပဲ​နော်။ ဟင်းချက် ပျင်းတဲ့ မာလာချစ်သူတို့အတွက်လည်း အို​ကေစိုပြည်​ပေါ့။
ချွမ်း​ဝေဝမ် မာလာ​မောက်ချိုက်အနှစ်ကို အရိုးပြုတ်ရည် (ဒါမှမဟုတ်) ​ရိုးရိုးရေထဲ ချိန်ဆ ထည့်ပြီး တည်ပါ။ 
ပွက်ပွက်ဆူ လာပြီ ဆိုရင်​တော့ ကိုယ်ကြိုက်နှစ်သက်ရာ အသား၊ အရွက်​တွေ ထည့်ပြုတ်လို့ ရပါပြီ​​။ 
ပါဝင် ပစ္စည်း​တွေ အကုန်ကျက်ပြီဆိုရင်​တော့ ​ပူပူ​နွေး​နွေး အဝ ​​လွေးလို့ ရပါပြီ​နော်။ 
Wow....လွယ်လွယ်​လေးပဲ​နော်။ ဟင်းချက် ပျင်းတဲ့ မာလာချစ်သူတို့အတွက်လည်း အို​ကေစိုပြည်​ပေါ့။
ချွမ်း​ဝေဝမ် မာလာ​မောက်ချိုက်အနှစ်ကို အရိုးပြုတ်ရည် (ဒါမှမဟုတ်) ​ရိုးရိုးရေထဲ ချိန်ဆ ထည့်ပြီး တည်ပါ။ 
ပွက်ပွက်ဆူ လာပြီ ဆိုရင်​တော့ ကိုယ်ကြိုက်နှစ်သက်ရာ အသား၊ အရွက်​တွေ ထည့်ပြုတ်လို့ ရပါပြီ​​။ 
ပါဝင် ပစ္စည်း​တွေ အကုန်ကျက်ပြီဆိုရင်​တော့ ​ပူပူ​နွေး​နွေး အဝ ​​လွေးလို့ ရပါပြီ​နော်။ 
Wow....လွယ်လွယ်​လေးပဲ​နော်။ ဟင်းချက် ပျင်းတဲ့ မာလာချစ်သူတို့အတွက်လည်း အို​ကေစိုပြည်​ပေါ့။

</p>
""";
